Revit 2016 API
IFCAggregate.GetIFCAggregateIterator Method
Returns a IFCAggregateIterator that iterates through the collection.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public IFCAggregateIterator GetIFCAggregateIterator()
Visual Basic
Public Function GetIFCAggregateIterator As IFCAggregateIterator
Visual C++
public:
IFCAggregateIterator^ GetIFCAggregateIterator()
See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace